tap "nikitabobko/tap"
tap "FelixKratz/formulae"

# Core system/dev tools
brew "git"
brew "gh"
brew "stow"

# Node development
brew "fnm"
brew "corepack"

# Editor
brew "neovim"

# Terminal quality-of-life
brew "tmux"
brew "zoxide"
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "fzf-tab"
brew "jq"
brew "starship"

# Main apps
cask "google-chrome"
cask "raycast"
cask "visual-studio-code"

# Terminal
cask "ghostty"

# AI coding agents
cask "codex"

# Terminal/font rice
cask "font-jetbrains-mono-nerd-font"

# Window management
brew "borders"
cask "aerospace"
